tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
static bool parse_app_nvs_u32(const char *value, uint32_t *out_value)
{
    char *end_ptr = NULL;
    unsigned long parsed = 0;

    if (value == NULL || out_value == NULL || value[0] == '\0') {
        return false;
    }

    errno = 0;
    parsed = strtoul(value, &end_ptr, 10);
    if (errno != 0 || end_ptr == value || *end_ptr != '\0' || parsed > UINT32_MAX) {
        return false;
    }

    *out_value = (uint32_t)parsed;
    return true;
}

static esp_err_t save_work_time_vars_to_app_nvs(void)
{
    char value[16];
    esp_err_t ret = ESP_OK;
    esp_err_t write_ret = ESP_OK;

    snprintf(value, sizeof(value), "%lu", (unsigned long)server_required_continue_work_time);
    write_ret = app_nvs_write_str(SERVER_REQUIRED_CONTINUE_WORK_TIME_NVS_KEY, value);
    if (write_ret != ESP_OK && ret == ESP_OK) {
        ret = write_ret;
    }

    snprintf(value, sizeof(value), "%lu", (unsigned long)wifi_standby_time_s);
    write_ret = app_nvs_write_str(WIFI_STANDBY_TIME_S_NVS_KEY, value);
    if (write_ret != ESP_OK && ret == ESP_OK) {
        ret = write_ret;
    }

    ESP_LOGI(TAG, "save app nvs continue=%lu standby=%lu ret=%s",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s,
             esp_err_to_name(ret));
    return ret;
}

static void load_work_time_vars_from_app_nvs(void)
{
    char value[16];
    char default_value[16];
    uint32_t parsed = 0;

    snprintf(default_value, sizeof(default_value), "%lu",
             (unsigned long)server_required_continue_work_time);
    if (app_nvs_read_str(SERVER_REQUIRED_CONTINUE_WORK_TIME_NVS_KEY,
                         value,
                         sizeof(value),
                         default_value) == ESP_OK &&
        parse_app_nvs_u32(value, &parsed)) {
        server_required_continue_work_time = clamp_continue_seconds(parsed);
    }

    snprintf(default_value, sizeof(default_value), "%lu",
             (unsigned long)wifi_standby_time_s);
    if (app_nvs_read_str(WIFI_STANDBY_TIME_S_NVS_KEY,
                         value,
                         sizeof(value),
                         default_value) == ESP_OK &&
        parse_app_nvs_u32(value, &parsed)) {
        wifi_standby_time_s = parsed;
    }

    ESP_LOGI(TAG, "load app nvs continue=%lu standby=%lu",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
}

static uint32_t update_working_time_seconds(void)
{
    TickType_t now = xTaskGetTickCount();
    if (s_wifi_work_start_tick == 0) {
        s_wifi_work_start_tick = now;
    }
    working_time = (uint32_t)(((now - s_wifi_work_start_tick) * portTICK_PERIOD_MS) / 1000U);
    return working_time;
}

static uint32_t http_activity_hold_remaining_seconds(TickType_t now)
{
    uint32_t encoded_tick = __atomic_load_n(&s_last_http_activity_tick_encoded, __ATOMIC_ACQUIRE);
    if (encoded_tick == 0) {
        return 0;
    }

    TickType_t last_tick = (TickType_t)(encoded_tick - 1U);
    TickType_t hold_ticks = pdMS_TO_TICKS(USER_WORK_STATE_HTTP_ACTIVITY_HOLD_SECONDS * 1000U);
    TickType_t elapsed_ticks = now - last_tick;
    if (elapsed_ticks >= hold_ticks) {
        return 0;
    }

    uint32_t remaining_ms = (uint32_t)((hold_ticks - elapsed_ticks) * portTICK_PERIOD_MS);
    return (remaining_ms + 999U) / 1000U;
}

static uint32_t ch583_activity_hold_remaining_seconds(TickType_t now)
{
    uint32_t encoded_tick = __atomic_load_n(&s_last_ch583_activity_tick_encoded, __ATOMIC_ACQUIRE);
    if (encoded_tick == 0) {
        return 0;
    }

    TickType_t last_tick = (TickType_t)(encoded_tick - 1U);
    TickType_t hold_ticks = pdMS_TO_TICKS(USER_WORK_STATE_CH583_ACTIVITY_HOLD_SECONDS * 1000U);
    TickType_t elapsed_ticks = now - last_tick;
    if (elapsed_ticks >= hold_ticks) {
        return 0;
    }

    uint32_t remaining_ms = (uint32_t)((hold_ticks - elapsed_ticks) * portTICK_PERIOD_MS);
    return (remaining_ms + 999U) / 1000U;
}

//调用   ServerNetworkStaWifiWorkTime_OnNetworkData  从头计
// Configure CH583/CH585 wake timer before POWER_OFF so slideshow can resume after power cut.
static uint32_t slideshow_startup_delay_seconds(void)
{
    return (TDX_SLIDESHOW_STARTUP_DELAY_MS + 999U) / 1000U;
}

static uint32_t slideshow_wake_advance_seconds(uint32_t *startup_delay_out)
{
    uint32_t startup_delay = slideshow_startup_delay_seconds();
    if (startup_delay_out != NULL) {
        *startup_delay_out = startup_delay;
    }
    return startup_delay + TDX_SLIDESHOW_WAKE_EXTRA_ADVANCE_SECONDS;
}

static void reset_work_time_counter_for_slideshow_short_interval(void)
{
    s_wifi_work_start_tick = xTaskGetTickCount();
    working_time = 0;
}

static void restore_work_time_after_one_shot_skip(void)
{
    server_required_continue_work_time = s_one_shot_restore_continue_time;
    wifi_standby_time_s = s_one_shot_restore_standby_time;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    __atomic_store_n(&s_one_shot_power_off_state, 0, __ATOMIC_RELEASE);
    UserLedStatus_SetPowerOffPending(false);
}

static bool should_skip_or_cancel_one_shot_power_off(void)
{
    uint8_t one_shot_state =
        __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
    if ((one_shot_state & USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT) == 0) {
        return false;
    }

    uint8_t mode = EpdDisplayMode_Get();
    /*
     * A one-shot created in DAILY mode becomes stale when cast, cast2pic, or
     * slideshow takes ownership. Generic EPD one-shots keep their old behavior.
     */
    if ((one_shot_state & USER_WORK_STATE_ONE_SHOT_DAILY_OWNER_BIT) != 0 &&
        mode != USER_EPD_DISPLAY_MODE_DAILY) {
        restore_work_time_after_one_shot_skip();
        ESP_LOGI(TAG,
                 "daily one-shot power off canceled because mode changed mode=%u(%s) restore_continue=%lu restore_standby=%lu",
                 (unsigned int)mode,
                 EpdDisplayMode_ToString(mode),
                 (unsigned long)server_required_continue_work_time,
                 (unsigned long)wifi_standby_time_s);
        return true;
    }

    if (mode != USER_EPD_DISPLAY_MODE_SLIDESHOW) {
        ESP_LOGI(TAG,
                 "one-shot power off skip slideshow remain check mode=%u(%s)",
                 (unsigned int)mode,
                 EpdDisplayMode_ToString(mode));
        return false;
    }

    uint32_t interval = 0;
    uint32_t elapsed = 0;
    uint32_t remain = 0;
    int64_t now_epoch = 0;
    int64_t next_epoch = 0;
    bool running = false;
    if (ServerNetworkStaSlideshow_GetScheduleTiming(&interval,
                                                    &now_epoch,
                                                    &next_epoch,
                                                    &remain,
                                                    &running) &&
        running) {
        char now_text[32] = {0};
        char next_text[32] = {0};
        format_epoch_local(now_epoch, now_text, sizeof(now_text));
        format_epoch_local(next_epoch, next_text, sizeof(next_text));
        if (remain <= USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS) {
            ESP_LOGI(TAG,
                     "one-shot power off skipped because slideshow next is soon remain=%lu min=%lu now=%lld(%s) next=%lld(%s)",
                     (unsigned long)remain,
                     (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                     (long long)now_epoch,
                     now_text,
                     (long long)next_epoch,
                     next_text);
            restore_work_time_after_one_shot_skip();
            return true;
        }
        ESP_LOGI(TAG,
                 "one-shot power off allowed by slideshow rtc remain=%lu min=%lu now=%lld(%s) next=%lld(%s)",
                 (unsigned long)remain,
                 (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                 (long long)now_epoch,
                 now_text,
                 (long long)next_epoch,
                 next_text);
        return false;
    }

    if (ServerNetworkStaSlideshow_GetRuntimeTiming(&interval, &elapsed, &running) &&
        running) {
        remain = interval > elapsed ? interval - elapsed : 0;
        if (remain <= USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS) {
            ESP_LOGI(TAG,
                     "one-shot power off skipped because slideshow next is soon remain=%lu min=%lu interval=%lu elapsed=%lu",
                     (unsigned long)remain,
                     (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                     (unsigned long)interval,
                     (unsigned long)elapsed);
            restore_work_time_after_one_shot_skip();
            return true;
        }
        ESP_LOGI(TAG,
                 "one-shot power off allowed by slideshow runtime remain=%lu min=%lu interval=%lu elapsed=%lu",
                 (unsigned long)remain,
                 (unsigned long)USER_EPD_DONE_LOW_POWER_SLIDESHOW_MIN_REMAIN_SECONDS,
                 (unsigned long)interval,
                 (unsigned long)elapsed);
    }
    return false;
}

