tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
static bool configure_ch583_wake_timer_before_power_off(bool *slideshow_enabled_out)
{
    uint32_t interval = TDX_SLIDESHOW_INTERVAL_MIN_SECONDS;
    bool random = false;
    uint8_t epd_mode = EpdDisplayMode_Get();
    bool daily_on = epd_mode == USER_EPD_DISPLAY_MODE_DAILY;
    bool slideshow_on =
        epd_mode == USER_EPD_DISPLAY_MODE_SLIDESHOW &&
        ServerNetworkStaSlideshow_IsSavedEnabled("/data", &interval, &random);
    bool wake_timer_on = false;
    int wake_ret;

    if (slideshow_enabled_out != NULL) {
        // Reuse this exact snapshot for the WIFI_PROVISION notification so the
        // wake-timer decision and reported shutdown mode cannot disagree.
        *slideshow_enabled_out = slideshow_on;
    }

    if (daily_on) {
        uint32_t wake_interval = 0;
        bool keep_awake = true;
        esp_err_t daily_ret =
            ServerNetworkStaDailyImage_GetPowerOffWakeSeconds(&wake_interval,
                                                               &keep_awake);
        if (daily_ret != ESP_OK) {
            ESP_LOGE(TAG,
                     "daily power off postponed because schedule is unavailable ret=%s",
                     esp_err_to_name(daily_ret));
            return false;
        }
        if (keep_awake) {
            ESP_LOGI(TAG, "daily power off postponed for due run window");
            return false;
        }
        ESP_LOGI(TAG, "daily wake timer on interval=%lu advance=%u",
                 (unsigned long)wake_interval,
                 (unsigned int)USER_DAILY_IMAGE_WAKE_ADVANCE_SECONDS);
        wake_ret = ch583_wifi_uart_send_wake_timer_on(wake_interval);
        if (wake_ret < 0) {
            ESP_LOGE(TAG,
                     "daily power off postponed because CH583 wake timer failed ret=%d",
                     wake_ret);
            return false;
        }
        wake_timer_on = true;
    } else if (slideshow_on) {
        if (interval < TDX_SLIDESHOW_INTERVAL_MIN_SECONDS ||
            interval > TDX_SLIDESHOW_INTERVAL_MAX_SECONDS) {
            interval = TDX_SLIDESHOW_INTERVAL_MIN_SECONDS;
        }

        uint32_t runtime_interval = 0;
        uint32_t runtime_elapsed = 0;
        bool runtime_running = false;
        uint32_t wake_interval = interval;
        uint32_t startup_delay = 0;
        uint32_t wake_advance = slideshow_wake_advance_seconds(&startup_delay);
        int64_t schedule_now = 0;
        int64_t schedule_next = 0;
        uint32_t schedule_remain = 0;
        if (ServerNetworkStaSlideshow_GetScheduleTiming(&runtime_interval,
                                                        &schedule_now,
                                                        &schedule_next,
                                                        &schedule_remain,
                                                        &runtime_running) &&
            runtime_running) {
            wake_interval = schedule_remain > 0 ? schedule_remain : 1U;
            runtime_elapsed = runtime_interval > schedule_remain ?
                              runtime_interval - schedule_remain :
                              0;
            char now_text[32] = {0};
            char next_text[32] = {0};
            format_epoch_local(schedule_now, now_text, sizeof(now_text));
            format_epoch_local(schedule_next, next_text, sizeof(next_text));
            ESP_LOGI(TAG,
                     "slideshow rtc wake timing now=%lld(%s) next=%lld(%s) remain=%lu interval=%lu",
                     (long long)schedule_now,
                     now_text,
                     (long long)schedule_next,
                     next_text,
                     (unsigned long)schedule_remain,
                     (unsigned long)runtime_interval);
        } else if (ServerNetworkStaSlideshow_GetRuntimeTiming(&runtime_interval,
                                                              &runtime_elapsed,
                                                              &runtime_running) &&
                   runtime_running &&
                   runtime_interval > 0) {
            wake_interval = runtime_interval > runtime_elapsed ? runtime_interval - runtime_elapsed : 1U;
        }
        wake_interval = wake_interval > wake_advance ? wake_interval - wake_advance : 1U;

        uint8_t one_shot_state =
            __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
        if ((one_shot_state & USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT) == 0 &&
            wake_interval < TDX_SLIDESHOW_POWER_OFF_MIN_WAKE_INTERVAL_SECONDS) {
            reset_work_time_counter_for_slideshow_short_interval();
            ESP_LOGI(TAG,
                     "slideshow wake interval too short, skip power off wake_interval=%lu min=%lu saved_interval=%lu elapsed=%lu startup_delay=%lu extra_advance=%lu wake_advance=%lu",
                     (unsigned long)wake_interval,
                     (unsigned long)TDX_SLIDESHOW_POWER_OFF_MIN_WAKE_INTERVAL_SECONDS,
                     (unsigned long)interval,
                     (unsigned long)runtime_elapsed,
                     (unsigned long)startup_delay,
                     (unsigned long)TDX_SLIDESHOW_WAKE_EXTRA_ADVANCE_SECONDS,
                     (unsigned long)wake_advance);
            return false;
        }

        ESP_LOGI(TAG,
                 "slideshow enabled before power off, wake timer on interval=%lu saved_interval=%lu elapsed=%lu startup_delay=%lu extra_advance=%lu wake_advance=%lu random=%d",
                 (unsigned long)wake_interval,
                 (unsigned long)interval,
                 (unsigned long)runtime_elapsed,
                 (unsigned long)startup_delay,
                 (unsigned long)TDX_SLIDESHOW_WAKE_EXTRA_ADVANCE_SECONDS,
                 (unsigned long)wake_advance,
                 random ? 1 : 0);
        wake_ret = ch583_wifi_uart_send_wake_timer_on(wake_interval);
        wake_timer_on = wake_ret >= 0;
    } else {
        ESP_LOGI(TAG, "slideshow disabled before power off, wake timer off");
        wake_ret = ch583_wifi_uart_send_wake_timer_off();
    }

    if (wake_ret < 0) {
        ESP_LOGW(TAG, "CH583 wake timer config failed ret=%d, continue power off", wake_ret);
    } else if (wake_timer_on) {
        // Roll back this timer if the current power-off attempt is canceled later.
        (void)__atomic_fetch_or(&s_runtime_state_flags,
                                USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_runtime_state_flags,
                                 ~USER_WORK_STATE_RUNTIME_WAKE_TIMER_CANCEL_PENDING_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    return true;
}

