tdxguiping/ESP32_S3_epaper/main/server_network_sta/wifi_work_time/server_network_sta_wifi_work_time.c
    errno = 0;
    value = strtol(pos, &end_ptr, 10);
    if (errno != 0 || end_ptr == pos || value < INT32_MIN || value > INT32_MAX) {
        return false;
    }
    while (*end_ptr == ' ' || *end_ptr == '\t' || *end_ptr == '\r' || *end_ptr == '\n') {
        end_ptr++;
    }
    if (*end_ptr != ',' && *end_ptr != '}') {
        return false;
    }
    *out = (int)value;
    return true;
}

static esp_err_t send_wifi_work_time_result(httpd_req_t *req, int result, const char *message)
{
    char json[176];
    if (result == TDX_JSON_RESULT_OK) {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d}",
                 TDX_JSON_RESULT_OK);
    } else {
        snprintf(json, sizeof(json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"%s\"}",
                 result,
                 message != NULL ? message : "set wifi work time failed");
    }

    ESP_LOGI(TAG, "set_wifi_work_time response: %s", json);
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

void ServerNetworkStaWifiWorkTime_OnNetworkData(void)
{
    working_time = 0;
    s_last_network_data_tick = xTaskGetTickCount();
    s_wifi_work_start_tick = s_last_network_data_tick;
    s_last_power_off_send_tick = 0;
    if (server_required_continue_work_time > 0) {
        ESP_LOGI(TAG, "activity reset working_time continue=%lu elapsed_ms=%u",
                 (unsigned long)server_required_continue_work_time,
                 (unsigned int)((s_last_network_data_tick - s_wifi_work_start_tick) * portTICK_PERIOD_MS));
    }
}

void ServerNetworkStaWifiWorkTime_OnHttpNetworkActivity(void)
{
    TickType_t now = xTaskGetTickCount();
    uint32_t encoded_tick = (uint32_t)now + 1U;
    if (encoded_tick == 0) {
        encoded_tick = 1U;
    }
    __atomic_store_n(&s_last_http_activity_tick_encoded, encoded_tick, __ATOMIC_RELEASE);
    s_last_power_off_send_tick = 0;
}

void ServerNetworkStaWifiWorkTime_OnCh583Activity(void)
{
    TickType_t now = xTaskGetTickCount();
    uint32_t encoded_tick = (uint32_t)now + 1U;
    if (encoded_tick == 0) {
        encoded_tick = 1U;
    }
    __atomic_store_n(&s_last_ch583_activity_tick_encoded, encoded_tick, __ATOMIC_RELEASE);
    s_last_power_off_send_tick = 0;
}

void ServerNetworkStaWifiWorkTime_OnCh583Initialized(void)
{
    // Record the timed hold before releasing the startup guard so shutdown cannot race initialization.
    ServerNetworkStaWifiWorkTime_OnCh583Activity();
    uint32_t old_flags = __atomic_fetch_and(&s_runtime_state_flags,
                                            ~USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT,
                                            __ATOMIC_ACQ_REL);
    if ((old_flags & USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT) != 0) {
        ESP_LOGI(TAG, "CH583 startup guard released, activity hold started seconds=%u",
                 (unsigned int)USER_WORK_STATE_CH583_ACTIVITY_HOLD_SECONDS);
    }
}

void ServerNetworkStaWifiWorkTime_RequestOneShotPowerOffCountdown(uint32_t seconds)
{
    if (seconds == 0) {
        return;
    }
    bool daily_owned =
        EpdDisplayMode_Get() == USER_EPD_DISPLAY_MODE_DAILY;
    /*
     * Keep an active one-shot deadline stable. The daily worker periodically
     * checks that shutdown is progressing, so resetting the counter here can
     * race the final power-off guard and cause an unnecessary cancel/retry.
     */
    uint8_t one_shot_state =
        __atomic_load_n(&s_one_shot_power_off_state, __ATOMIC_ACQUIRE);
    if ((one_shot_state & USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT) != 0) {
        if (daily_owned) {
            (void)__atomic_fetch_or(&s_one_shot_power_off_state,
                                    USER_WORK_STATE_ONE_SHOT_DAILY_OWNER_BIT,
                                    __ATOMIC_ACQ_REL);
        }
        ESP_LOGI(TAG,
                 "one-shot power off countdown already active, keep target=%lu",
                 (unsigned long)server_required_continue_work_time);
        return;
    }
    s_one_shot_restore_continue_time = server_required_continue_work_time;
    s_one_shot_restore_standby_time = wifi_standby_time_s;

    server_required_continue_work_time = seconds;
    wifi_standby_time_s = seconds;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    one_shot_state = USER_WORK_STATE_ONE_SHOT_ACTIVE_BIT;
    if (daily_owned) {
        one_shot_state |= USER_WORK_STATE_ONE_SHOT_DAILY_OWNER_BIT;
    }
    __atomic_store_n(&s_one_shot_power_off_state, one_shot_state, __ATOMIC_RELEASE);
    UserLedStatus_SetPowerOffPending(true);

    ESP_LOGI(TAG,
             "one-shot power off countdown requested target=%lu standby=%lu",
             (unsigned long)server_required_continue_work_time,
             (unsigned long)wifi_standby_time_s);
}

void ServerNetworkStaWifiWorkTime_SetImageSaveInProgress(bool in_progress)
{
    bool old_value = __atomic_exchange_n(&s_image_save_in_progress, in_progress, __ATOMIC_ACQ_REL);
    if (old_value != in_progress) {
        ESP_LOGI(TAG, "image save in progress=%d", in_progress ? 1 : 0);
    }
}

bool ServerNetworkStaWifiWorkTime_IsImageSaveInProgress(void)
{
    return __atomic_load_n(&s_image_save_in_progress, __ATOMIC_ACQUIRE);
}

void ServerNetworkStaWifiWorkTime_SetDailyImageInProgress(bool in_progress)
{
    bool old_value = __atomic_exchange_n(&s_daily_image_in_progress,
                                         in_progress,
                                         __ATOMIC_ACQ_REL);
    if (old_value != in_progress) {
        ESP_LOGI(TAG, "daily image in progress=%d", in_progress ? 1 : 0);
    }
}

bool ServerNetworkStaWifiWorkTime_IsDailyImageInProgress(void)
{
    return __atomic_load_n(&s_daily_image_in_progress, __ATOMIC_ACQUIRE);
}

void ServerNetworkStaWifiWorkTime_SetOtaWriteInProgress(bool in_progress)
{
    if (in_progress) {
        (void)__atomic_fetch_or(&s_ota_hold_flags,
                                USER_WORK_STATE_OTA_HOLD_WRITE_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_ota_hold_flags,
                                 ~USER_WORK_STATE_OTA_HOLD_WRITE_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    ESP_LOGI(TAG, "ota write in progress=%d hold=0x%lx",
             in_progress ? 1 : 0,
             (unsigned long)__atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE));
}

void ServerNetworkStaWifiWorkTime_SetOtaReceiveInProgress(bool in_progress)
{
    if (in_progress) {
        (void)__atomic_fetch_or(&s_ota_hold_flags,
                                USER_WORK_STATE_OTA_HOLD_RECEIVE_BIT,
                                __ATOMIC_ACQ_REL);
    } else {
        (void)__atomic_fetch_and(&s_ota_hold_flags,
                                 ~USER_WORK_STATE_OTA_HOLD_RECEIVE_BIT,
                                 __ATOMIC_ACQ_REL);
    }
    ESP_LOGI(TAG, "ota receive in progress=%d hold=0x%lx",
             in_progress ? 1 : 0,
             (unsigned long)__atomic_load_n(&s_ota_hold_flags, __ATOMIC_ACQUIRE));
}

esp_err_t ServerNetworkStaWifiWorkTime_Init(void)
{
    user_work_state_nvs_blob_t blob = {0};
    size_t stored_size = 0;

    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    (void)__atomic_fetch_or(&s_runtime_state_flags,
                            USER_WORK_STATE_RUNTIME_CH583_STARTUP_PENDING_BIT,
                            __ATOMIC_ACQ_REL);
    ESP_LOGI(TAG, "CH583 startup guard active until UART initialization completes");
    esp_err_t ret = load_work_state_from_nvs(&blob, &stored_size);
    if (ret == ESP_OK) {
        log_work_state_blob("read value", &blob);
        apply_work_state_blob(&blob);
    } else {
        sleep_time = 0;
        working_time = 0;
        server_required_continue_work_time = USER_WORK_STATE_DEFAULT_CONTINUE_SECONDS;
        wifi_standby_time_s = USER_WORK_STATE_DEFAULT_STANDBY_SECONDS;
        ESP_LOGW(TAG, "use default work state ret=%s stored_size=%u continue=%lu standby=%lu",
                 esp_err_to_name(ret), (unsigned int)stored_size,
                 (unsigned long)server_required_continue_work_time,
                 (unsigned long)wifi_standby_time_s);
        ret = save_work_state_to_nvs();
    }

    load_work_time_vars_from_app_nvs();
    esp_err_t app_nvs_ret = save_work_time_vars_to_app_nvs();
    if (ret == ESP_OK && app_nvs_ret != ESP_OK) {
        ret = app_nvs_ret;
    }

    if (s_work_state_task == NULL) {
        BaseType_t task_ret = xTaskCreate(work_state_task,
                                          "work_state",
                                          USER_WORK_STATE_TASK_STACK_SIZE,
                                          NULL,
                                          USER_WORK_STATE_TASK_PRIORITY,
                                          &s_work_state_task);
        if (task_ret != pdPASS) {
            ESP_LOGE(TAG, "create work_state task failed");
            return ESP_ERR_NO_MEM;
        }
    }

    return ret;
}

esp_err_t ServerNetworkStaWifiWorkTime_SetAndSave(uint32_t seconds)
{
    if (s_work_state_task == NULL) {
        ESP_LOGE(TAG, "set work time apply failed because work_state task is not ready");
        return ESP_ERR_INVALID_STATE;
    }

    server_required_continue_work_time = clamp_continue_seconds(seconds);
    wifi_standby_time_s = seconds;
    working_time = 0;
    s_wifi_work_start_tick = xTaskGetTickCount();
    s_last_network_data_tick = s_wifi_work_start_tick;
    s_last_power_off_send_tick = 0;
    __atomic_store_n(&s_one_shot_power_off_state, 0, __ATOMIC_RELEASE);
    UserLedStatus_SetPowerOffPending(false);

